{"meta":{"title":"pph's Blog","subtitle":null,"description":null,"author":"pph","url":"https://ken3527549.github.io"},"pages":[{"title":"About","date":"2018-08-01T14:07:16.210Z","updated":"2017-09-12T18:06:44.538Z","comments":true,"path":"about/index.html","permalink":"https://ken3527549.github.io/about/index.html","excerpt":"","text":""},{"title":"Categories","date":"2018-08-01T14:07:16.210Z","updated":"2017-09-12T18:06:44.538Z","comments":true,"path":"categories/index.html","permalink":"https://ken3527549.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-08-01T14:07:16.211Z","updated":"2017-09-12T18:06:44.538Z","comments":true,"path":"tags/index.html","permalink":"https://ken3527549.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"S3筆記","slug":"S3筆記","date":"2017-10-05T14:32:42.000Z","updated":"2017-10-14T02:56:18.766Z","comments":true,"path":"2017/10/05/S3筆記/","link":"","permalink":"https://ken3527549.github.io/2017/10/05/S3筆記/","excerpt":"","text":"S3簡介 Amazon S3 has a simple web services interface that you can use to store and retrieve any amount of data, at any time, from anywhere on the web. the core concepts of Amazon S3, such as buckets and objects. 創建buckets store and retrieve your objects manage permissions on your resources access control defines who can access objects and buckets within Amazon S3, and the type of access (e.g., READ and WRITE). authentication process verifies the identity of a user who is trying to access Amazon Web Services (AWS). Advantages to Amazon S3 Create Buckets Store data in Buckets Download data Permissions Standard interfaces Amazon S3 Concepts Buckets A bucket is a container for objects stored in Amazon S3. Every object is contained in a bucket. organize the Amazon S3 namespace at the highest level identify the account responsible for storage and data transfer charges play a role in access control serve as the unit of aggregation for usage reporting Objects Objects are the fundamental entities stored in Amazon S3 consist of object data and metadata The data portion is opaque to Amazon S3 The metadata is a set of name-value pairs that describe the object These include some default metadata, such as the date last modified, and standard HTTP metadata, such as Content-Type An object is uniquely identified within a bucket by a key (name) and a version ID Keys A key is the unique identifier for an object within a bucket Every object in a bucket has exactly one key S3 can be thought of as a basic data map between “bucket + key + version” and the object itself Every object in Amazon S3 can be uniquely addressed through the combination of the web service endpoint, bucket name, key, and optionally, a version Regions You might choose a region to optimize latency, minimize costs, or address regulatory requirements Objects stored in a region never leave the region unless you explicitly transfer them to another region S3 Data Consistency Model Amazon S3 provides read-after-write consistency for PUTS of new objects in your S3 bucket in all regions with one caveat The caveat is that if you make a HEAD or GET request to the key name (to find if the object exists) before creating the object, Amazon S3 provides eventual consistency for read-after-write.(如果創建object前先用HEAD或GET檢查object存在與否，則S3將提供最終讀寫一致性) Amazon S3 offers eventual consistency for overwrite PUTS and DELETES in all regions. Updates to a single key are atomic(更新後讀取可能回傳舊的或新的數據，但不會寫入損壞或部分數據) Amazon S3 achieves high availability by replicating data across multiple servers within Amazon’s data centers.(因此可能會產生一些時間延遲) Eventually Consistent Read Stale reads possible(可能過時讀取) Lowest read latency Highest read throughput Consistent Read No stale reads(無過時讀取) Potential higher read latency(潛在高延遲) Potential lower read throughput(潛在更低讀取吞吐量) Features Reduced Redundancy Storage(RRS) RRS enables customers to reduce their costs by storing non-critical, reproducible data at lower levels of redundancy than Amazon S3 standard storage. Bucket Policies AWS Identity and Access Management can use IAM with Amazon S3 to control the type of access a user or group of users has to specific parts of an Amazon S3 bucket your AWS account owns. Access Control Lists Versioning OperationsFollowing are the most common operations you’ll execute through the API. Create a Bucket Write an Object Read an Object Deleting an Object Listing Keys Bucket Configuration Options location policy and ACL (Access Control List) cors (cross-origin resource sharing) website logging event notification versioning lifecycle cross-region replication tagging requestPayment transfer acceleration 參考Introduction Storage Classes STANDARD: ideal for performance-sensitive use cases and frequently accessed data. STANDARD_IA: (IA, for infrequent access) is optimized for long-lived and less frequently accessed data GLACIER: suitable for archiving data where data access is infrequent. Archived objects are not available for real-time access. You must first restore the objects before you can access them(封存檔案) 參考storage-class-intro Restoring Archived Objects Expedited: For all but the largest archived objects (250 MB+), data accessed using Expedited retrievals are typically made available within 1–5 minutes.(最快最貴最小) Standard: Standard retrievals typically complete within 3–5 hours.(預設選項) Bulk: enabling you to retrieve large amounts, even petabytes, of data inexpensively in a day. Bulk retrievals typically complete within 5–12 hours.(允許最大檔案) 參考restoring-objects Object Lifecycle Management Transition actions: transition to another storage class. Expiration actions: deletes the expired objects on your behalf. When Should I Use Lifecycle Configuration for Objects? 對需要定期刪除的檔案設置生命週期(如log) 近期常用，過一段時間不用的檔案 基於備份資料上傳的檔案 參考object-lifecycle-mgmt","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"EC2筆記","slug":"EC2筆記","date":"2017-09-24T04:29:19.000Z","updated":"2018-08-01T15:38:02.965Z","comments":true,"path":"2017/09/24/EC2筆記/","link":"","permalink":"https://ken3527549.github.io/2017/09/24/EC2筆記/","excerpt":"","text":"What Is Amazon EC2? Amazon Elastic Compute Cloud (Amazon EC2) provides scalable computing capacity in the Amazon Web Services (AWS) cloud. Using Amazon EC2 eliminates your need to invest in hardware up front, so you can develop and deploy applications faster. You can use Amazon EC2 to launch as many or as few virtual servers as you need, configure security and networking, and manage storage. Amazon EC2 enables you to scale up or down to handle changes in requirements or spikes in popularity, reducing your need to forecast traffic. EC2功能 虛擬計算環境，稱為實例(Instance)。 Preconfigured templates for your instances, known as Amazon Machine Images (AMIs), that package the bits you need for your server (including the operating system and additional software) Various configurations of CPU, memory, storage, and networking capacity for your instances, known as instance types Secure login information for your instances using key pairs (AWS stores the public key, and you store the private key in a secure place) Storage volumes for temporary data that’s deleted when you stop or terminate your instance, known as instance store volumes Persistent storage volumes for your data using Amazon Elastic Block Store (Amazon EBS), known as Amazon EBS volumes Multiple physical locations for your resources, such as instances and Amazon EBS volumes, known as regions and Availability Zones A firewall that enables you to specify the protocols, ports, and source IP ranges that can reach your instances using security groups Static IPv4 addresses for dynamic cloud computing, known as Elastic IP addresses Metadata, known as tags, that you can create and assign to your Amazon EC2 resources Virtual networks you can create that are logically isolated from the rest of the AWS cloud, and that you can optionally connect to your own network, known as virtual private clouds (VPCs) Basics 實例和AMI 區域和可用區 實例類型(Instance types) 標籤 Networking and Security Key pair Sercurity Group Elastic IP address EC2 and VPC Storage EBS Instance Store Related Services Auto Scaling User Guide AWS CloudFormation User Guide AWS Elastic Beanstalk Developer Guide AWS OpsWorks User Guide 參考concepts Best Practices for Amazon EC2This checklist is intended to help you get the maximum benefit from and satisfaction with Amazon EC2. Security and Network 使用IAM 用最嚴格的SG 定期更新實例上的系統和軟體 在VPC中啟動實例(而不是EC2-classic)。 Storage Understand the implications of the root device type for data persistence, backup, and recovery. 使用EBS以確保實例終止後數據可以保留。 Use the instance store available for your instance to store temporary data. Resource Management Use instance metadata and custom resource tags to track and identify your AWS resources. View your current limits for Amazon EC2. Backup and Recovery 使用EBS快照備份EBS，並為實例創建AMI。 掛多個可用區部屬關鍵元件，並適當備份數據。 Design your applications to handle dynamic IP addressing when your instance restarts. Monitor and respond to events. Ensure that you are prepared to handle failover. For a basic solution, you can manually attach a network interface or Elastic IP address to a replacement instance. 定期測試實例和EBS發生故障時的恢復過程(AMI和EBS快照)。 參考EC2 best practices AMI Types Region (see Regions and Availability Zones) Operating system Architecture (32-bit or 64-bit) Launch Permissions public: The owner grants launch permissions to all AWS accounts. explicit: The owner grants launch permissions to specific AWS accounts. implicit: The owner has implicit launch permissions for an AMI. Storage for the Root Device Storage for the Root DeviceAMI可分成兩類： backed by Amazon EBS root device for an instance launched from the AMI is an Amazon EBS volume created from an Amazon EBS snapshot 16 TiB Size limit Usually less than 1 minute Boot time By default, the root volume is deleted when the instance terminates Data on any other Amazon EBS volumes persists after instance termination by default Data on any instance store volumes persists only during the life of the instance Upgrading: The instance type, kernel, RAM disk, and user data can be changed while the instance is stopped You’re charged for instance usage, Amazon EBS volume usage, and storing your AMI as an Amazon EBS snapshot. AMI creation/bundling: Uses a single command/call Stopped state: Can be placed in stopped state where instance is not running, but the root volume is persisted in Amazon EBSbacked by instance store root device for an instance launched from the AMI is an instance store volume created from a template stored in Amazon S3 10 GiB Size limit Usually less than 5 minutes Boot time Data on any instance store volumes persists only during the life of the instance. Data on any Amazon EBS volumes persists after instance termination by default Instance attributes are fixed for the life of an instance. Upgrading: Instance attributes are fixed for the life of an instance. You’re charged for instance usage and storing your AMI in Amazon S3. AMI creation/bundling: Requires installation and use of AMI tools Stopped state: Cannot be in stopped state; instances are running or terminated參考ComponentsAMIs Linux AMI Virtualization TypesFinding a Linux AMI The region The operating system The architecture: 32-bit (i386) or 64-bit (x86_64) The root device type: Amazon EBS or instance store The provider: Amazon Web Services, Oracle, IBM, Microsoft, or the community Shared AMIsGuidelines for Shared Linux AMIs Update the AMI Tools at Boot Time Disable Password-Based Remote Logins for Root Disable Local Root Access Remove SSH Host Key Pairs Install Public Key Credentials Disabling sshd DNS Checks (Optional) Identify Yourself Protect Yourself參考building-shared-amis Amazon EC2 InstancesBefore you launch a production environment, you need to answer the following questions. What instance type best meets my needs? What purchasing option best meets my needs? Which type of root volume meets my needs? Would I benefit from using a virtual private cloud? Can I remotely manage a fleet of EC2 instances and machines in my hybrid environment? Instance Purchasing Options On-Demand instances(按需實例) 按小時為您啟動的實例付費 Reserved Instances(預留實例) 以大幅折扣購買一年期到三年期的始終可用的實例 Scheduled Instances(計畫實例) 以一年為期限購買按指定重複計劃始終可用的實例 Spot instances(競價型實例) 對未使用的實例競價，只要這些實例可用且您的出價高於現貨價格，就可以以大幅折扣運行這些實例 Dedicated hosts(專用主機) 為完全專用於運行您的實例的物理主機付費，通過您現有的按套接字、按內核或按 VM 的軟件許可證來降低成本 Dedicated instances(專用實例) 按小時付費的在單一租戶硬件上運行的實例 參考instance-purchasing-options Instance LifecycleThe purchasing option that you choose affects the lifecycle of the instance Notice that you can’t stop and start an instance store-backed instance 參考ec2-instance-lifecycle Storage Amazon EBS use Amazon EBS as a primary storage device for data that requires frequent and granular updates(ex:run a database on an instance.) Instance Store The data on an instance store volume persists only during the life of the associated instance; if you stop or terminate an instance, any data on instance store volumes is lost. Amazon EFS use an EFS file system as a common data source for workloads and applications running on multiple instances. Amazon S3 use Amazon S3 to store backup copies of your data and applications. Elastic Load BalancerElastic Load Balancing Products Application Load Balancer Network Load Balancer Classic Load Balancer ELB產品比較comparison","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"},{"name":"EC2","slug":"EC2","permalink":"https://ken3527549.github.io/tags/EC2/"}]},{"title":"RDS筆記","slug":"RDS筆記","date":"2017-09-24T02:36:12.000Z","updated":"2017-09-24T01:36:27.197Z","comments":true,"path":"2017/09/24/RDS筆記/","link":"","permalink":"https://ken3527549.github.io/2017/09/24/RDS筆記/","excerpt":"","text":"在VPC中創建RDS實例教程：创建 Amazon VPC 以用于 Amazon RDS 数据库实例在 VPC 中使用 Amazon RDS 数据库实例","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"建立雲端架構：AWS 最佳實務","slug":"建立雲端架構：AWS-最佳實務","date":"2017-09-17T16:30:08.000Z","updated":"2017-09-20T16:08:25.116Z","comments":true,"path":"2017/09/18/建立雲端架構：AWS-最佳實務/","link":"","permalink":"https://ken3527549.github.io/2017/09/18/建立雲端架構：AWS-最佳實務/","excerpt":"","text":"摘要 對開發人員在AWS上提供架構的解決方案。 提供安全、可靠及高性價比的架構模式和建議。 The Cloud Computing Differencenon-cloud environment 需猜測負載需求，可能導致昂貴的資源閒置或效能不足等問題。 cloud environment 動態調整以滿足實際的需求，且只需支付使用到的資源費用。 Security Built In Global, Available, and Unlimited Capacity IT Assets Become Programmable Resources Design Principles提供廣泛的專案提供設計模式和架構選項。 Scalability雲端計算依據需求提供了能夠符合的容量，但架構的設計需要能有效利用這些資源。通常有兩種擴展架構的方法：垂直(Vertically)和水平(Horizontally)。 Scaling Vertically垂直擴展代表升級單一資源的規格(例如，升級大容量的硬碟、更快的CPU等)。在EC2上可以透過停止實例並重新調整RAM、CUP等等資源。此種方式最終可能達到極限，不一定能達到最好的成本效益。但此種方式容易實現，在許多案例上短期已經足夠。 Scaling Horizontally水平擴展代表增加資源的數量(例如，買更多硬碟、增加CPU數量)。這是構建利用雲端計算彈性的互聯網規模應用程式的好方法。並不是所有的情況都是要將負載均衡分配到資源上，以下針對可能的情況做研究。 Stateless Applications 無狀態應用程序是一個不需要先前交互知識的應用程序，不存儲會話(session)信息。 給予相同的輸入，向任何最終用戶提供相同的響應。 無狀態應用程序可以水平擴展，因為任何可用的計算資源（例如EC2實例，AWS Lambda函數）可以為任何請求提供服務。 可以根據需要添加更多的計算資源。 當不再需要該容量時，可以安全地終止任何單個資源。 這些資源不需要意識到同伴的存在，所需要的只是將工作負載分配給他們。 Push model: 分佈工作負載的一種流行方式是使用負載平衡解決方案，如彈性負載平衡（ELB）服務。彈性負載平衡在多個EC2實例之間路由傳入的應用程序請求。另一種方法是實施DNS循環（例如，使用Amazon Route 53）。 Pull model：異步事件驅動的工作負載不需要負載平衡解決方案，因為可用pull model來取代。在pull model中，需要執行的任務或需要處理的數據可以使用Amazon Simple Queue Service（Amazon SQS）作為消息存儲在隊列中，或作為Amazon Kinesis之類的streaming data solution。然後，多個計算節點可以拉和消耗這些消息，以分佈式方式處理它們。Stateless Components 在實踐中，大多數應用程序需要維護某種狀態信息。例如，Web應用程序需要確認用戶是否登錄，以根據以前的操作呈現個性化內容。 但仍然可以通過不在本地文件系統中存儲任何需要持久存儲的單個請求的內容，使這些體系結構的一部分成為無狀態。 Consider only storing a unique session identifier in a HTTP cookie and storing more detailed user session information server-side. Most programming platforms provide a native session management mechanism that works this way, however this is often stored on the local file system by default. This would result in a stateful architecture.此問題的常見解決方案是將用戶會話信息存儲在數據庫中。 由於Amazon DynamoDB具有可擴展性，高可用性和耐用特性，因此它是一個很好的選擇。 對於許多平台，有開放源代碼的函式庫可以讓您在Amazon DynamoDB3中存儲本機會話。 其他情況需要存儲較大的文件（例如，用戶上傳，批處理過程的中期結果等）。 通過將這些文件放置在Amazon S3或Amazon Elastic File System（Amazon EFS）等共享存儲層中，可以避免引入有狀態的組件。 另一個例子是複雜的多步驟工作流程，您需要跟踪每次執行的當前狀態。 亞馬遜簡單工作流程服務（Amazon SWF）可用於集中存儲執行歷史記錄，並使這些工作負載無狀態。Stateful Components Distributed Processing一次性資源而不是固定資源伺服器在傳統的基礎設施環境中，引入新硬體會有成本和時間等問題。實務上會需要手動登入到伺服器去安裝軟體或修復問題。在設計AWS時，利用雲計算的動態配置特性，可將服務器和其他組件視為臨時資源。可根據需要啟動盡可能多的資源，只要需要它們即可使用它們。 固定的長時間運行的服務器的另一個問題是配置漂移。通過時間應用的更改和軟件補丁可能會導致不同環境下的未經測試和異構配置。這個問題可以用不變的基礎設施模式解決。使用這種方法，服務器一旦啟動，從未在其整個生命週期內更新。相反，當有問題或需要更新時，服務器將被替換為具有最新配置的新服務器。通過這種方式，資源始終處於一致（測試）狀態，並且回滾變得更容易執行。 Instantiating Compute Resources無論您是部署新的環境進行測試，還是增加現有系統的容量以應付額外的負載，您將不希望通過配置和代碼手動設置新的資源。有幾種方式實現自動化和可重複的方法： Bootstrapping 利用腳本複製特定的數據將資源帶到特定的狀態。 可依照不同環境(例如，生產、測試等)變化不同參數，相同腳本重新使用無需修改。 Golden Images EC2、RDS、EBS等資源可用此種方式。 golden image：該資源特定狀態的快照。 啟動速度比Bootstrapping更快。 您可以自定義Amazon EC2實例，然後通過創建Amazon Machine Image（AMI）來保存其配置。您可以根據需要從AMI啟動盡可能多的實例，並且它們都將包括您所做的自定義。每次要更改配置時，都需要創建一個新的黃金映像，因此您需要一個版本控制約定來管理您的黃金映像。我們建議您使用腳本來引導用於創建AMI的EC2實例。這將為您提供靈活的方式來測試和修改這些圖像。 或者，如果您有現有的內部虛擬化環境，則可以使用AWS的VM導入/導出將各種虛擬化格式轉換為AMI。 雖然黃金圖像在啟動新的EC2實例時最常用，但也可以應用於Amazon RDS數據庫或Amazon EBS卷等資源。 例如，當啟動新的測試環境時，您可能需要通過從特定的Amazon RDS快照中實例化該數據庫來預填充數據庫，而不是從冗長的SQL腳本導入數據。 開發人員普遍使用的另一個選項是Docker，AWS Elastic Beanstalk和Amazon EC2 容器服務（Amazon ECS）支持Docker，並允許您跨Amazon EC2實例集群部署和管理多個Docker容器。 Hybrid 可以使用兩種方法的組合，其中配置的一些部分被捕獲在黃金圖像中，而其他方式通過引導動作來動態配置。 不經常更改或引入外部依賴項的項目通常是您的黃金圖像的一部分。 AWS Elastic Beanstalk follows the hybrid model. 它提供預配置的運行時環境（每個環境都由自己的AMI啟動），但允許您運行引導操作（通過配置文件稱為.ebextensions），並配置環境變量來參數化環境差異。Infrastructure as Code AWS assets are programmable, you can apply techniques, practices, and tools from software development to make your whole infrastructure reusable, maintainable, extensible, and testable AWS CloudFormation templates give developers and systems administrators an easy way to create and manage a collection of related AWS resources, and provision and update them in an orderly and predictable fashion.AutomationAWS上部署時，有很多自動化機會，因此您可以提高系統的穩定性和組織的效率： AWS Elastic Beanstalk Amazon EC2 Auto recovery Auto Scaling Amazon CloudWatch Alarms Amazon CloudWatch Events AWS OpsWorks Lifecycle events AWS Lambda Scheduled events Loose Coupling隨著應用程序複雜性的增加，IT系統的理想屬性是可以將其分解成更小，鬆散耦合的組件。 這意味著IT系統應該以減少相互依賴關係的方式進行設計 - 一個組件中的更改或失敗不應該級聯到其他組件。 Well-Defined Interfaces減少系統中相互依賴關係的一種方法是允許各種組件僅通過特定的技術診斷接口（例如，RESTful API）來相互交互。 Amazon API Gateway是一款全面管理的服務，可讓開發人員輕鬆創建，發布，維護，監控和保護任何規模的API。 Service Discovery(???????)如何實現服務發現對於Amazon EC2託管服務，通過彈性負載平衡服務實現服務發現的一種簡單方法。因為每個負載平衡器都擁有自己的主機名，所以現在您可以通過穩定的端點使用服務。這可以與DNS和私有的Amazon Route53區域結合使用，即使特定的負載均衡器的端點也可以在任何時間點進行抽象和修改。另一個選擇是使用服務註冊和發現方法來允許檢索任何給定服務的端點IP地址和端口號。因為服務發現成為組件之間的粘合劑，所以重要的是它是高可用性和可靠性的。如果不使用負載平衡器，服務發現也應適用於健康檢查等。示例實現包括使用標籤組合，高可用性數據庫和調用AWS API的自定義腳本或打開s的自定義解決方案 Asynchronous IntegrationAsynchronous integration是服務之間鬆散耦合的另一種形式。 該模型適用於不需要立即響應的任何交互以及已經註冊請求的確認就足夠了。 它涉及一個生成事件的組件，另一個組件消耗它們。 這兩個組件不通過直接點對點交互進行集成，通常通過中間持久存儲層（例如Amazon SQS隊列或像Amazon Kinesis這樣的流數據平台）進行integration。 這種方法使兩個組件脫鉤，並引入額外的彈性。因此，例如，如果從隊列中讀取消息的進程失敗，那麼仍然可以將消息添加到隊列中以在系統恢復時進行處理。它還允許您從前端尖峰保護較不可擴展的後端服務，並在成本和處理滯後之間找到正確的權衡。例如，您可以決定不需要擴展數據庫以適應偶然的寫查詢峰值，只要您最終以某種延遲異步處理這些查詢即可。最後，通過將緩慢的操作從交互式請求路徑移動，您還可以改善最終用戶體驗。 Examples of asynchronous integration 前端應用程序將作業插入隊列系統（如Amazon SQS）中。後端系統檢索這些作業，並按照自己的速度處理它們。 API生成事件並將其推送到Amazon Kinesis流中。後端應用程序批處理這些事件以創建存儲在數據庫中的聚合時間序列數據。 多個異構系統使用亞馬遜SWF來溝通其間的工作流程，而不會直接相互交互。 AWS Lambda功能可以消耗來自各種AWS源的事件（例如，Amazon DynamoDB更新流，Amazon S3事件通知等）。在這種情況下，您甚至不需要擔心實現排隊或其他異步集成方法因為服務為您處理這個。 Graceful Failure增加鬆散耦合的另一種方法是構建應用程序，使其以優雅的方式處理組件故障。 您可以確定減少對最終用戶的影響的方法，並提高您在脫機過程中取得進展的能力，即使發生某些組件故障。 Graceful failure in practice可以使用指數退避和抖動策略重試失敗的請求，或者可以將其存儲在隊列中以備後續處理。 對於前端接口，當例如數據庫服務器不可用時，可能會提供替代或緩存的內容，而不是完全失敗。 如果您的主站點不可用，Amazon Route 53 DNS故障轉移功能還可以監控您的網站並自動將訪問者路由到備份站點。 您可以將備份站點作為Amazon S3上的靜態網站或作為單獨的動態環境託管。 Databases 在AWS上，這些約束由以開源成本提供企業績效的託管數據庫服務來刪除。 因此，應用程序在多邊形數據層之上運行，為每個工作負載選擇正確的技術並不罕見。 為每個工作負載確定正確的數據庫技術The following questions can help you take decisions on which solutions to include in your architecture: Is this a read-heavy, write-heavy, or balanced workload? How many reads and writes per second are you going to need? How will those values change if the number of users increases? How much data will you need to store and for how long? How quickly do you foresee this will grow? Is there an upper limit in the foreseeable future? What is the size of each object (average, min, max)? How are these objects going to be accessed? What are the requirements in terms of durability of data? Is this data store going to be your “source of truth”? What are your latency requirements? How many concurrent users do you need to support? What is your data model and how are you going to query the data? Are your queries relational in nature (e.g., JOINs between multiple tables)? Could you denormalize your schema to create flatter data structures that are easier to scale? What kind of functionality do you require? Do you need strong integrity controls or are you looking for more flexibility (e.g., schema-less data stores)? Do you require sophisticated reporting or search capabilities? Are your developers more familiar with relational databases than NoSQL? Relational Databases關係數據庫（通常稱為RDBS或SQL數據庫）將數據規範化為明確定義的表格結構，稱為表，由行和列組成。 它們提供強大的查詢語言，靈活的索引功能，強大的完整性控制，以及以快速高效的方式組合來自多個表的數據的能力。 亞馬遜關係數據庫服務（Amazon RDS）可以輕鬆地在雲中建立，運行和擴展關係數據庫。 NoSQL DatabasesNoSQL是用於描述數據庫的術語，用於交換關係數據庫的一些查詢和事務功能，以便更靈活地將數據模型水平無縫縮放。 NoSQL數據庫使用各種數據模型，包括圖形，鍵值對和JSON文檔。 NoSQL數據庫被廣泛認可，易於開發，可擴展的性能，高可用性和彈性。 Amazon DynamoDB是一種快速靈活的NoSQL數據庫服務，適用於任何規模需要一致，單位毫秒延遲的應用程序。 它是一個完全託管的雲數據庫，同時支持文檔和鍵值存儲模型。 Data Warehouse數據倉庫是一種特殊類型的關係數據庫，針對大量數據的分析和報告進行了優化。 它可以用於組合來自不同來源的交易數據（例如，Web應用程序中的用戶行為，來自您的財務和計費系統的數據，CRM等），使其可用於分析和決策。傳統上，建立，運行和擴展數據倉庫已經非常複雜和昂貴。 在AWS上，您可以利用Amazon Redshift，這是一種託管數據倉庫服務，旨在以不到傳統解決方案成本的十分之一來運營。 Search需要復雜搜索功能的應用程序通常會超出關係或NoSQL數據庫的功能。 搜索服務可用於索引和搜索結構化和自由文本格式，並且可以支持在其他數據庫中不可用的功能，例如customizable result ranking, faceting for filtering, synonyms, stemming, etc。在AWS上，您可以選擇Amazon CloudSearch和Amazon Elasticsearch Service（Amazon ES）。 一方面，Amazon CloudSearch是一種託管服務，需要很少的配置並自動擴展。 另一方面，Amazon ES提供了一個開放源代碼API，可以讓您更好地控製配置細節。 亞馬遜ES還發展成為一個不僅僅是一個搜索解決方案的很多。 它通常用作用例，如日誌分析，實時應用程序監控和點擊流分析。 Removing Single Points of Failure","categories":[],"tags":[{"name":"whitepaper","slug":"whitepaper","permalink":"https://ken3527549.github.io/tags/whitepaper/"}]},{"title":"VPC筆記","slug":"VPC筆記","date":"2017-09-17T06:34:42.000Z","updated":"2017-09-24T04:06:04.399Z","comments":true,"path":"2017/09/17/VPC筆記/","link":"","permalink":"https://ken3527549.github.io/2017/09/17/VPC筆記/","excerpt":"","text":"VPC(Virtual Private Cloud) no hardware. no physical data centers. define your own network space and control your network. EC2 inside your network are exposed to the internet. provision a logically isolated section of the Amazon Web Services. 僅用於自己的AWS帳戶的虛擬網路，在邏輯上與AWS雲中的其他虛擬網路隔絕。 可在VPC中啟動其他AWS資源。 使用案例 VPC with a Single Public Subnet Only您可以在 VPC 中託管部落格這類基本 Web 應用程式或簡單的網站，並獲得 Amazon VPC 提供的額外隱私權和安全性。您可以建立安全群組規則，在允許 Web 伺服器回應入站 HTTP 和 SSL 請求的同時，禁止該 Web 伺服器啟動存取網際網路的出站連接，以此鞏固網站的安全保護。 VPC with Public and Private Subnets您可以使用 Amazon VPC 託管多層 Web 應用程式，在您的 Web 伺服器、應用程式伺服器和資料庫之間嚴格實施存取和安全限制。您可以在公眾可存取的子網路中啟動 Web 伺服器，而在非公眾存取的子網路中啟動應用程式伺服器和資料庫。這些應用程式伺服器和資料庫無法從網際網路直接存取，但它們依然可以透過 NAT 閘道存取網際網路，例如，下載修補程式等。您可以使用由網路存取控制清單和安全群組提供的對內和對外資料包篩選功能，控制伺服器和子網路之間的存取。 VPC with Public and Private Subnets and Hardware VPN Access您可以建立一個 VPC，其中一個子網路中的執行個體 (如 Web 伺服器) 可與網際網路通訊，而其他子網路中的執行個體 (如應用程式伺服器) 可與公司網路上的資料庫通訊。VPC 與公司網路之間的 IPsec VPN 連接，有助於保護雲端中的應用程式伺服器與資料中心內的資料庫之間進行的所有通訊。您的 VPC 中的 Web 伺服器和應用程式伺服器可以利用 Amazon EC2 的彈性功能和 Auto Scaling 功能，根據需要進行擴展和收縮。 VPC with a Private Subnet Only and Hardware VPN Access透過將 VPC 與公司網路連接，您可以將公司應用程式轉移到雲端中、啟動額外的 Web 伺服器，或者增加網路的運算容量。由於 VPC 可以託管在公司防火牆的後方，因此您可以將 IT 資源無縫遷移到雲端中，並且不必變更使用者對這些應用程式的存取方式。場景範例 影片Technical Introduction to Amazon VPC - Virtual Private Cloud on AWS FAQVPC FAQ VPC or Subnet 的 CIDR Bloakc Size 可以調整？ 不可以。VPC 和 Subnet 的 CIDR 建立好之後就無法更動。 Public Subnet &amp; Private Subnet Public Subnet: Subnet經路由到 Internet Gateway，稱為Public Subnet。 Public Subnet中的Instance如需要通過IPv4與Internet通訊，該Subnet要有”Public IPv4 address” or “Elastic IP address (IPv4)” Private Subnet: Subnet沒有路由到 Internet Gateway，稱為Private Subnet。 If a subnet doesn’t have a route to the internet gateway, but has its traffic routed to a virtual private gateway for a VPN connection, the subnet is known as a VPN-only subnet. Currently, we do not support IPv6 traffic over a VPN connection.每个子网都必须关联一个路由表，这个路由表可指定允许出站流量离开子网的可用路由。您创建的每个子网都会自动关联 VPC 的主路由表。 VPN connectionVPN 組成: Virtual Private Gateway: A virtual private gateway is the VPN concentrator on the Amazon side of the VPN connection. Customer Gateway: A customer gateway is a physical device or software application on your side of the VPN connection.參考VPC VPN VPC subnet大小 VPC支援IPv4 and IPv6，並且有不同的CIDR大小限制。 預設都有IPv4 CIDR，且不能更改。 可選擇是否開啟IPv6 CIDR。 IPv4的subnet大小 The allowed block size is between a /16 netmask (65,536 IP addresses) and /28 netmask (16 IP addresses). The CIDR block of a subnet can be the same as the CIDR block for the VPC (for a single subnet in the VPC). If you create more than one subnet in a VPC, the CIDR blocks of the subnets cannot overlap. The first four IP addresses and the last IP address in each subnet CIDR block are not available to use, and cannot be assigned to an instance.For example, in a subnet with CIDR block 10.0.0.0/24, the following five IP addresses are reserved: 10.0.0.0: Network address. 10.0.0.1: Reserved by AWS for the VPC router. 10.0.0.2: Reserved by AWS. The IP address of the DNS server is always the base of the VPC network range plus two; however, we also reserve the base of each subnet range plus two. For VPCs with multiple CIDR blocks, the IP address of the DNS server is located in the primary CIDR. For more information, see Amazon DNS Server. 10.0.0.3: Reserved by AWS for future use. 10.0.0.255: Network broadcast address. We do not support broadcast in a VPC, therefore we reserve this address. VPC and Subnet Sizing for IPv6 The CIDR block uses a fixed prefix length of /56. You cannot choose the range of addresses or the IPv6 CIDR block size. Subnet router table 每個subnet都要有一個router table。 創建subnet時會自動關聯”主要(main)”router table。 What sort of security options do I have over my virtual network? Create a public-facing subnet for your web servers that have access to the internet and place your backend systems such as databases or application servers in a private-facing subnet with no internet access. subnets public: internet可存取 private: 只有VPC內部的資源可以存取 internet gateways: 每個VPC限定一個 route tables security group 概念像是一個虛擬防火牆，可控制實例出入站的數據流(traffic)。 network ACLs 可控制subnet的出入站數據流(traffic)。 每個subnet必須與一個ACL關聯(創建subnet時會與預設ACL關聯)。 VPC 建立時會自帶一個 default network ACL，並允許所有 inbound &amp; outbound 的流量。 自訂的 network ACL，預設會拒絕所有 inbound &amp; outbound 的流量。 當 subnet 與自訂的 network ACL 關聯時，原本的 network ACL 關聯就會移除 (每個 subnet 只能關聯一個 network ACL)。 network ACL 的規則判定順序是以設定中的 Rule # 欄位中的數字為主，數字越小越早使用。 network ACL 可設定 inbound &amp; outbound rules，且可設定 allow or deny (Security Group 只能設定 allow rule)。 network ACL 是 stateless，因此設定規則時要同時考慮 inbound &amp; outbound rule (也就是要考慮 ephemeral ports 的設定) DHCP options sets 與本地網路的連接 本地與VPC IP地址重疊的部分會被捨棄無法使用。 參考VPC 和子網 SercurityVPC提供三種安全性和監控功能： Sercurity group Network access control lists (ACLs) Flow logs: Capture information about the IP traffic going to and from network interfaces in your VPC. Comparison of Security Groups and Network ACLs Network ACLs: 針對 VPC Subnet 有 Allow / Deny Operates at the subnet level (second layer of defense) Is stateless: Return traffic must be explicitly allowed by rules We process rules in number order when deciding whether to allow traffic Automatically applies to all instances in the subnets it’s associated with (backup layer of defense, so you don’t have to rely on someone specifying the security group) Security Group: 針對 EC2 Instance / ENI 只有 Allow, 沒有 Deny Operates at the instance level (first layer of defense) Is stateful: Return traffic is automatically allowed, regardless of any rules We evaluate all rules before deciding whether to allow traffic Applies to an instance only if someone specifies the security group when launching the instance, or associates the security group with the instance later on 參考VPC Security VPC Networking ComponentsYou can use the following components to configure networking in your VPC: Network Interfaces Route Tables Internet Gateways Egress-Only Internet Gateways DHCP Options Sets DNS Elastic IP Addresses VPC Endpoints NAT: 允許private subnet中的實例通過IPv4連接到Internet的出站連接，並阻止未經請求的Internet入站連接。 VPC Peering ClassicLink VPC Peering Allow you to connect one VPC with another via a direct network route using private IP addresses. VPC 对等连接是两个 VPC 之间的网络连接，通过此连接，您可以使用私有 IPv4 地址或 IPv6 地址在两个 VPC 之间路由流量。这两个 VPC 中的实例可以彼此通信，就像它们在同一网络中一样。 您可以在自己的 VPC 之间创建 VPC 对等连接，或者在自己的 VPC 与其他 AWS 账户中的 VPC 之间创建连接。在这两种情况下，VPC 都必须位于同一区域。 A VPC peering connection is a one to one relationship between two VPCs. You can create multiple VPC peering connections for each VPC that you own, but transitive peering relationships are not supported: you do not have any peering relationship with VPCs that your VPC is not directly peered with. VPC Peering限制 You cannot create a VPC peering connection between VPCs in different regions. You cannot create a VPC peering connection between VPCs that have matching or overlapping IPv4 or IPv6 CIDR blocks. You have a limit on the number active and pending VPC peering connections that you can have per VPC. (無法藉由VPC peering關係peering到另一個無peering關係的VPC You cannot have more than one VPC peering connection between the same two VPCs at the same time.參考PeeringGuide參考UserGuide參考VPC Networking Bastion Bastion 其實就是個跳板的概念，讓外面的使用者可以透過 Internet 存取到位於 NAT gateway 後方的 resource 先連到 Bastion，再透過 private connection 連到內部的 VPC使用限制","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"FB 圖形API","slug":"FB-圖形API","date":"2017-09-16T01:49:08.000Z","updated":"2017-09-16T01:14:07.273Z","comments":true,"path":"2017/09/16/FB-圖形API/","link":"","permalink":"https://ken3527549.github.io/2017/09/16/FB-圖形API/","excerpt":"基本入門The Graph API is named after the idea of a ‘social graph’ - a representation of the information on Facebook composed of: 節點(nodes) - 基本的事物(things)，例如用戶(User), 相片(Photo), 粉專(Page), 留言(Comment)等 關係連線(edges) - 事物的連結, 像是粉專的相片, 或相片的留言等 欄位(fields) - 事物的資訊，像是用戶的生日，或粉專名稱等 圖形API以HTTP為基礎，因此可以搭配具有HTTP程式庫的語言來應用，例如 cURL 及 urllib。可以藉由在這些節點上對節點或關係連線發出 HTTP GET 要求來讀取 API。，例如：http://graph.facebook.com/facebook/picture?redirect=false 回應：123456&#123; \"data\": &#123; \"is_silhouette\": false, \"url\": \"https://scontent.xx.fbcdn.net/v/t1.0-1/p50x50/12006203_10154088276211729_2432197377106462187_n.png?oh=a98c9ee6f3064e2b947ea6c065438a22&amp;oe=5A4DA523\" &#125;&#125; 大部分的圖形 API 要求必須使用存取權杖(access_token)，也就是您的應用程式執行 Facebook 登入後所產生的存取權杖。 幾乎所有的 API 要求都會往 graph.facebook.com 傳遞，唯一的例外是影片上傳使用 graph-video.facebook.com。 物件 ID每一個節點都有獨特的 ID，用來透過圖形 API 存取節點。請求節點的方式：12GET graph.facebook.com /&#123;node-id&#125; 或是關係連線：12GET graph.facebook.com /&#123;node-id&#125;/&#123;edge-name&#125; 也可以使用參數發出 HTTP POST 要求，將 API 發佈至節點：12POST graph.facebook.com /&#123;node-id&#125; 12POST graph.facebook.com /&#123;node-id&#125;/&#123;edge-name&#125; 透過 API 進行刪除是使用對相同端點發出 HTTP DELETE 要求來完成（進行更新則是透過 POST 要求）。 如何對特定版本的圖形 API 進行呼叫：12GET graph.facebook.com /vX.Y/&#123;request-path&#125; 例如對v2.10呼叫：12GET graph.facebook.com /v2.10/me","text":"基本入門The Graph API is named after the idea of a ‘social graph’ - a representation of the information on Facebook composed of: 節點(nodes) - 基本的事物(things)，例如用戶(User), 相片(Photo), 粉專(Page), 留言(Comment)等 關係連線(edges) - 事物的連結, 像是粉專的相片, 或相片的留言等 欄位(fields) - 事物的資訊，像是用戶的生日，或粉專名稱等 圖形API以HTTP為基礎，因此可以搭配具有HTTP程式庫的語言來應用，例如 cURL 及 urllib。可以藉由在這些節點上對節點或關係連線發出 HTTP GET 要求來讀取 API。，例如：http://graph.facebook.com/facebook/picture?redirect=false 回應：123456&#123; \"data\": &#123; \"is_silhouette\": false, \"url\": \"https://scontent.xx.fbcdn.net/v/t1.0-1/p50x50/12006203_10154088276211729_2432197377106462187_n.png?oh=a98c9ee6f3064e2b947ea6c065438a22&amp;oe=5A4DA523\" &#125;&#125; 大部分的圖形 API 要求必須使用存取權杖(access_token)，也就是您的應用程式執行 Facebook 登入後所產生的存取權杖。 幾乎所有的 API 要求都會往 graph.facebook.com 傳遞，唯一的例外是影片上傳使用 graph-video.facebook.com。 物件 ID每一個節點都有獨特的 ID，用來透過圖形 API 存取節點。請求節點的方式：12GET graph.facebook.com /&#123;node-id&#125; 或是關係連線：12GET graph.facebook.com /&#123;node-id&#125;/&#123;edge-name&#125; 也可以使用參數發出 HTTP POST 要求，將 API 發佈至節點：12POST graph.facebook.com /&#123;node-id&#125; 12POST graph.facebook.com /&#123;node-id&#125;/&#123;edge-name&#125; 透過 API 進行刪除是使用對相同端點發出 HTTP DELETE 要求來完成（進行更新則是透過 POST 要求）。 如何對特定版本的圖形 API 進行呼叫：12GET graph.facebook.com /vX.Y/&#123;request-path&#125; 例如對v2.10呼叫：12GET graph.facebook.com /v2.10/me","categories":[],"tags":[]},{"title":"How are parameters sent in an HTTP POST request?","slug":"How-are-parameters-sent-in-an-HTTP-POST-request","date":"2017-09-16T01:32:09.000Z","updated":"2017-09-16T00:46:50.245Z","comments":true,"path":"2017/09/16/How-are-parameters-sent-in-an-HTTP-POST-request/","link":"","permalink":"https://ken3527549.github.io/2017/09/16/How-are-parameters-sent-in-an-HTTP-POST-request/","excerpt":"","text":"POST(relevant RFC section)When receiving a POST request, you should always expect a “payload”, or, in HTTP terms: a message body.The message body in itself is pretty useless, as there is no standard format.The body format is defined by the Content-Type header.When using a HTML FORM element with method=”POST”, this is usually application/x-www-form-urlencoded.Another very common type is multipart/form-data if you use file uploads.But is could be anything, ranging from text/plain, over application/json or even a custom application/octet-stream. In any case, if a POST request is made with a Content-Type which cannot be handled by the application, it should return a 415 status-code. Using a standard HTML form encoded document as example, the application should perform the following steps: Read the Content-Type field If the value is not one of the supported media-types, then return a response with a 415 status code otherwise, decode the values from the message body. Again, languages like PHP, or web-frameworks for other popular languages will probably handle this for you. The exception to this is the 415 error. No framework can predict which content-types your application chooses to support and/or not support. This is up to you. From:https://stackoverflow.com/questions/14551194/how-are-parameters-sent-in-an-http-post-request","categories":[],"tags":[]},{"title":"IAM筆記","slug":"AWS-IAM實作筆記","date":"2017-09-14T14:50:46.000Z","updated":"2017-09-17T05:31:25.240Z","comments":true,"path":"2017/09/14/AWS-IAM實作筆記/","link":"","permalink":"https://ken3527549.github.io/2017/09/14/AWS-IAM實作筆記/","excerpt":"","text":"IAM功能 管理多個IAM使用者及其存取權。 管理聯合身分使用者的存取權。 所有 AWS 客戶都可使用 IAM。此服務並不收取額外費用。 IAM使用者可以向 Amazon S3 和 EC2 等 Web 服務提出請求。 政策(policy) IAM使用者存取資源的權限設定被稱為政策(policy)。 IAM policy Simulator IAM角色(role) 角色和使用者或群組無關，他是一個獨立的實體身分。 透過將定義好的存取權(permission)委派給角色，IAM使用者、不同 AWS 帳戶下的 IAM 使用者或EC2之類的AWS服務，可以利用角色權限執行功能。 實作流程 Create groups of users. Set permissions for each group. Generate a password. Sign into the AWS Management Console as an IAM. MFA(AWS Multi-Factor-Authertication)在使用者名稱及密碼外加一層認證機制 FAQIAM FAQ 影片Technical Introduction to AWS IAM - Identity and Access Management on AWS","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"Lambda筆記","slug":"AWS-Lambda實作筆記","date":"2017-09-14T14:49:53.000Z","updated":"2017-09-17T05:31:31.428Z","comments":true,"path":"2017/09/14/AWS-Lambda實作筆記/","link":"","permalink":"https://ken3527549.github.io/2017/09/14/AWS-Lambda實作筆記/","excerpt":"","text":"Lambda功能 可在無伺服器環境下執行程式。 Lambda優點 不用管理及維護伺服器。 自動平衡負載。 每個觸發都是平行且獨立執行。 提供資源監視。 沒有執行程式就沒有費用。 不用學習新的語言、工具或框架。 收費 For 100 milliseconds the code executes. Number of times the code is trigged. 觸發方式 change data. shifts in system state. action by users. by other AWS services(S3, DynamoDB, Kinesis, SNS, CloudWatch, etc.) 影片Technical Introduction to AWS Lambda - Serverless Compute on AWS","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"Certified Solutions Architect – Associate","slug":"AWS-Certified-Solutions-Architect-–-Associate","date":"2017-09-13T16:01:44.000Z","updated":"2017-09-17T05:32:00.189Z","comments":true,"path":"2017/09/14/AWS-Certified-Solutions-Architect-–-Associate/","link":"","permalink":"https://ken3527549.github.io/2017/09/14/AWS-Certified-Solutions-Architect-–-Associate/","excerpt":"","text":"準備考試前： 考試範圍 實作練習重點 EC2 S3 VPC Route 53 RDS SQS 實作可從以下資源著手： User Guide Developer Guide Whitepapers AWS Developer Forums 準備資料官方建議資料：考試建議的途徑 培訓培訓 考試指南考試指南 實作練習qwiklabs AWS 白皮書AWS 白皮書的特色是提供完整豐富的 AWS 技術類白皮書清單，內容涵蓋架構、安全性和成本等主題。官方列舉出來的重點白皮書： 建立雲端架構：AWS 最佳實務 為使用 AWS 服務建立設計解決方案架構提供規範指導。 AWS 安全最佳實務 使用 AWS 服務的安全權威指導。 Amazon Web Services：安全程序概觀 AWS 架構良好的結構 驗證您架構框架的概觀。 AWS 上的開發和測試 使用 AWS 服務的軟體開發生命週期測試環境。 使用 AWS 的備份和復原方法 建立符合 RTO 和 RPO 要求的備份與恢復解決方案的指導。 Amazon Virtual Private Cloud 連線選項 將 VPC 彼此連接以及連接到其他遠端網路。 AWS 定價如何運作 使用 AWS 每月成本簡易計算器來估算每月 AWS 用量成本的指導。 AWS 常見問答集AWS 常見問答集官方列舉出來的重點FAQ： Amazon EC2 Amazon S3 Amazon VPC Amazon Route 53 Amazon RDS Amazon SQS 參加練習考試練習考試 AWS re:InventAWS 全球年度技術大會 AWS Youtube Channel AWS Slideshare","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"https://ken3527549.github.io/tags/AWS/"}]},{"title":"test_my_site","slug":"test-my-site","date":"2017-09-12T14:58:07.000Z","updated":"2017-09-13T14:42:38.064Z","comments":true,"path":"2017/09/12/test-my-site/","link":"","permalink":"https://ken3527549.github.io/2017/09/12/test-my-site/","excerpt":"Test content!","text":"Test content!","categories":[],"tags":[{"name":"sdf","slug":"sdf","permalink":"https://ken3527549.github.io/tags/sdf/"}]}]}